# CurtainGrids Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainSystem..::..CurtainGrids Property
CurtainSystem Class See Also
---
Get all the CurtainGrid object of this CurtainSystem. Each CurtainGrid corresponds to one face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurtainGridSet CurtainGrids { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurtainGrids As CurtainGridSet
	Get
```

Visual C++
---
```text
public:
property CurtainGridSet^ CurtainGrids {
	CurtainGridSet^ get ();
}
```

# ### Return Value
A CurtainGrid set will be returned if the operation succeeds. nullNothingnullptra null reference (Nothing in Visual Basic) will be returned if the CurtainSystem doesn't include any CurtainGrid.
# See Also
CurtainSystem Class
Autodesk.Revit.DB Namespace